ERP DEV.WMS/src/Catalogs/вмс_КарточкаПоклажедателя/вмс_КарточкаПоклажедателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_КарточкаПоклажедателя</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ХарактеристикаПоклажедателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УпаковкаПоклажедателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БезХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_КарточкаПоклажедателя/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура НоменклатураУчетнойСистемыПриИзмененииНаСервере()
		
	Объект.Характеристика = Неопределено;
	Объект.Упаковка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураУчетнойСистемыПриИзменении(Элемент)
	
	НоменклатураУчетнойСистемыПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УпаковкаУчетнойСистемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номенклатура учетной системы не заполнена";
		Сообщение.Сообщить();
	Иначе 
		Элементы.УпаковкаУчетнойСистемы.РежимВыбораИзСписка = Истина;
		Список = СписокЕдИзм(Объект.Номенклатура);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ПослеЗакрытияВыбораУпаковки", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыборе, Список);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СписокЕдИзм(ПередаваемаяНоменклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.НаборУпаковок КАК НаборУпаковок,
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.ИспользоватьУпаковки КАК ИспользоватьУпаковки
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО ВТ.НаборУпаковок = УпаковкиЕдиницыИзмерения.Владелец";
	
	Запрос.УстановитьПараметр("Ссылка", ПередаваемаяНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Список = Новый СписокЗначений;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИспользоватьУпаковки = Истина Тогда
				Список.Добавить(Выборка.Ссылка);         
			Иначе
				Список.Добавить(Выборка.ЕдиницаИзмерения); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВыбораУпаковки(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Упаковка = Результат.Значение;
	КонецЕсли;    
	
	Элементы.УпаковкаУчетнойСистемы.РежимВыбораИзСписка = Ложь;  
	
КонецПроцедуры 

&НаКлиенте
Процедура ХарактеристикаУчетнойСистемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номенклатура учетной системы не заполнена";
		Сообщение.Сообщить();
	Иначе 
		Элементы.ХарактеристикаУчетнойСистемы.РежимВыбораИзСписка = Истина;
		Список = СписокХарактеристик(Объект.Номенклатура);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ПослеЗакрытияВыбораХарактеристик", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыборе, Список);
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция СписокХарактеристик(ПередаваемаяНоменклатура)
	
	Список = Новый СписокЗначений;
	
	Если Не вмс_АдаптацияКонфигураций.ИспользуютсяХарактеристики() Тогда
		Возврат Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПередаваемаяНоменклатура) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатуры
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
		
		ИмяСправочникаХарактеристики = "Справочник." + вмс_АдаптацияКонфигураций.ПустаяХарактеристика().Метаданные().Имя;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ХарактеристикиНоменклатуры", ИмяСправочникаХарактеристики);
		
		Запрос.УстановитьПараметр("Владелец", ПередаваемаяНоменклатура);
		Запрос.УстановитьПараметр("ВидНоменклатуры", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПередаваемаяНоменклатура, "ВидНоменклатуры"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = Запрос.Выполнить().Выбрать(); 
			
			Пока Выборка.Следующий() Цикл
				Список.Добавить(Выборка.Ссылка);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВыбораХарактеристик(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Характеристика = Результат.Значение;
	КонецЕсли;    
	
	Элементы.ХарактеристикаУчетнойСистемы.РежимВыбораИзСписка = Ложь;  
	
КонецПроцедуры 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Объект.Контрагент) Тогда
		Если Объект.БезХарактеристики Тогда
			Элементы.Характеристика.Видимость = Ложь;   
			Элементы.ХарактеристикаУчетнойСистемы.Видимость = Ложь;
		Иначе
			Элементы.БезХарактеристики.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.БезХарактеристики.Видимость = Ложь;
		Элементы.Характеристика.Видимость = Ложь;     
		Элементы.ХарактеристикаУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;                        
	
КонецПроцедуры
